<template>
    <div
        class="flex max-w-[560px] justify-between rounded-2xl bg-light-gray p-4 md:rounded-[20px] md:p-5"
    >
        <img
            class="hidden h-[140px] w-[140px] rounded-3xl md:block"
            :src="img"
            alt="foto"
        />
        <div class="md:ml-5">
            <div class="flex md:block">
                <img
                    class="h-[48px] w-[48px] rounded-xl md:hidden"
                    :src="img"
                    alt="foto"
                />
                <div class="ml-3 md:ml-0">
                    <h5
                        class="mt-[2px] text-xl font-semibold leading-6 md:mt-1 md:text-2xl md:leading-7"
                    >
                        {{ name }}
                    </h5>
                    <div
                        class="mt-1 flex flex-wrap items-center gap-1 text-sm font-normal"
                    >
                        <template v-if="status == 'verified'">
                            <svg
                                width="16"
                                height="16"
                                viewBox="0 0 16 16"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg"
                            >
                                <path
                                    d="M7.50173 0.560558C7.76692 0.262214 8.23308 0.262215 8.49827 0.560559L9.64404 1.84955C9.8043 2.02984 10.0495 2.1095 10.2851 2.05784L11.9697 1.68849C12.3596 1.603 12.7367 1.877 12.7759 2.27424L12.9452 3.99052C12.9689 4.23058 13.1204 4.43913 13.3414 4.53583L14.9214 5.2272C15.287 5.38722 15.4311 5.83056 15.2293 6.17497L14.3575 7.66298C14.2355 7.87111 14.2355 8.12889 14.3575 8.33702L15.2293 9.82503C15.4311 10.1694 15.287 10.6128 14.9214 10.7728L13.3414 11.4642C13.1204 11.5609 12.9689 11.7694 12.9452 12.0095L12.7759 13.7258C12.7367 14.123 12.3596 14.397 11.9697 14.3115L10.2851 13.9422C10.0495 13.8905 9.8043 13.9702 9.64404 14.1505L8.49827 15.4394C8.23308 15.7378 7.76692 15.7378 7.50173 15.4394L6.35596 14.1505C6.1957 13.9702 5.95054 13.8905 5.71491 13.9422L4.03032 14.3115C3.64041 14.397 3.26328 14.123 3.22409 13.7258L3.0548 12.0095C3.03112 11.7694 2.8796 11.5609 2.65861 11.4642L1.07865 10.7728C0.712954 10.6128 0.568903 10.1694 0.770696 9.82503L1.64254 8.33702C1.76448 8.12889 1.76448 7.87111 1.64254 7.66298L0.770696 6.17497C0.568903 5.83056 0.712954 5.38722 1.07865 5.2272L2.65861 4.53583C2.8796 4.43913 3.03112 4.23058 3.0548 3.99052L3.22409 2.27424C3.26328 1.877 3.64041 1.603 4.03032 1.68849L5.71491 2.05784C5.95054 2.1095 6.1957 2.02984 6.35596 1.84955L7.50173 0.560558Z"
                                    fill="#337566"
                                />
                                <path
                                    d="M4.83334 8.10526L6.76191 10L10.8333 6"
                                    stroke="#F5F5F5"
                                    stroke-linecap="round"
                                />
                            </svg>
                            <span class="hidden md:block"
                                >Документы проверены</span
                            >
                            <span class="md:hidden">Проверен</span>
                            <span>•</span>
                        </template>
                        <template v-if="rating">
                            <svg
                                width="16"
                                height="16"
                                viewBox="0 0 16 16"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg"
                            >
                                <path
                                    d="M14.9439 5.26471C15.0761 5.67647 14.9733 6 14.65 6.25L11.314 8.77941L12.5926 12.8971C12.7542 13.4706 12.328 14 11.799 14C11.6227 14 11.461 13.9412 11.314 13.8235L7.99282 11.2941L4.6716 13.8235C4.49354 13.9443 4.27645 13.9932 4.06386 13.9605C3.85126 13.9277 3.6589 13.8158 3.52534 13.6471C3.43942 13.5446 3.38307 13.4206 3.36235 13.2884C3.34164 13.1563 3.35734 13.0209 3.40778 12.8971L4.6716 8.80882L1.33569 6.25C1.02708 6 0.924208 5.67647 1.05647 5.26471C1.17403 4.91176 1.48264 4.67647 1.82064 4.67647H5.93543L7.21395 0.573529C7.31682 0.235294 7.62543 0 7.97813 0C8.34552 0 8.66882 0.25 8.77169 0.602941L10.0502 4.67647H14.165C14.5177 4.67647 14.8263 4.91176 14.9439 5.26471Z"
                                    fill="#337566"
                                />
                            </svg>
                            <span>{{ rating }}</span>
                        </template>
                        <span v-if="comments">•</span>
                        <span v-if="comments">{{ comments }} отзывов</span>
                        <span v-else>Нет отзывов</span>
                    </div>
                </div>
            </div>
            <p
                class="mt-2 max-h-[96px] overflow-hidden text-sm font-normal md:mt-3 md:max-h-[72px]"
            >
                {{ desc }}
            </p>
        </div>
    </div>
</template>
<script setup>
const props = defineProps({
    img: String,
    name: String,
    status: String,
    rating: Number,
    comments: Number,
    desc: String,
});
</script>
